#### Select columns by dtype

In [31]:
import pandas as pd

In [32]:
titanic_df = pd.read_csv('../seaborn-data/titanic.csv')
titanic_df.head(n=3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [33]:
titanic_df.dtypes

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [34]:
titanic_df_subset_i = titanic_df.select_dtypes(include = ['int64', 'bool'])
titanic_df_subset_i.head(n=3)

   survived  pclass  sibsp  parch  adult_male  alone
0         0       3      1      0        True  False
1         1       1      1      0       False  False
2         1       3      0      0       False   True

In [35]:
titanic_df_subset_i.dtypes

survived      int64
pclass        int64
sibsp         int64
parch         int64
adult_male     bool
alone          bool
dtype: object

In [36]:
titanic_df_subset_ii = titanic_df.select_dtypes(exclude = ['int64', 'bool'])
titanic_df_subset_ii.head(n=3)

      sex   age     fare embarked  class    who deck  embark_town alive
0    male  22.0   7.2500        S  Third    man  NaN  Southampton    no
1  female  38.0  71.2833        C  First  woman    C    Cherbourg   yes
2  female  26.0   7.9250        S  Third  woman  NaN  Southampton   yes

In [37]:
titanic_df_subset_ii.dtypes

sex             object
age            float64
fare           float64
embarked        object
class           object
who             object
deck            object
embark_town     object
alive           object
dtype: object